export default {
  todos: [{
    id: '1',
    name: '程序设计基础期末考试',
    category: '考试',
    time: '2023-02-01 16:00:00',
    end: '2023-02-01 18:00:00',
    labels: ['闭卷', '2小时', '在线监控']
  }, {
    id: '2',
    name: '计算机组成原理课程实验',
    category: '实验',
    time: '',
    end: '2023-02-19 8:00:00',
    labels: ['实验报告', '实验成果物', '个人']
  }, {
    id: '3',
    name: '编译原理',
    category: '课程',
    time: '2023-02-20 10:00:00',
    end: '2023-02-20 11:30:00',
    labels: ['直播', '2课时']
  }, {
    id: '4',
    name: 'C语言设计基础',
    category: '课程',
    time: '2023-02-20 11:40:00',
    end: '2023-02-20 12:00:00',
    labels: ['腾讯会议', '2课时']
  }, {
    id: '5',
    name: '计算机组成原理',
    category: '作业',
    time: '',
    end: '2023-02-20 24:00:00',
    labels: ['提交', '批改']
  }],
  logs: [{
    id: '1',
    name: '关于做好2021级、2022级全日制普通本科生转专业有关工作的通知',
    top: true
  }, {
    id: '2',
    name: '教务相关下载（2020年1月之前的文件发布）',
    top: true
  }, {
    id: '3',
    name: '关于2022年下半年全国大学英语四、六级考试报名的通知',
    top: false
  }, {
    id: '4',
    name: '关于调整重新学习缴费时间的通知',
    top: false
  }]
}
