export default {
  todos: [{
    name: '程序设计基础期末考试',
    category: '考试',
    time: '2023-02-01 16:00:00',
    end: '2023-02-01 18:00:00',
    labels: ['闭卷', '2小时', '在线监控']
  }, {
    name: '计算机组成原理课程实验',
    category: '实验',
    time: '',
    end: '2023-02-19 8:00:00',
    labels: ['实验报告', '实验成果物', '个人']
  }, {
    name: '编译原理',
    category: '课程',
    time: '2023-02-20 10:00:00',
    end: '2023-02-20 11:30:00',
    labels: ['直播', '2课时']
  }, {
    name: 'C语言设计基础',
    category: '课程',
    time: '2023-02-20 11:40:00',
    end: '2023-02-20 12:00:00',
    labels: ['腾讯会议', '2课时']
  }]
}
